

   Mobile IPv6                                                 B. Haley
   Internet Draft                                       Hewlett-Packard
   Document: draft-ietf-mip6-ha-switch-00.txt            V. Devarapalli
   Expires: December, 2006                              Azaire Networks
                                                                H. Deng
                                                                Hitachi
                                                               J. Kempf
                                                        DoCoMo USA Labs
                                                              June 2006



                 Mobility Header Home Agent Switch Message
                     draft-ietf-mip6-ha-switch-00.txt


Status of this Memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
        http://www.ietf.org/ietf/1id-abstracts.txt

   The list of Internet-Draft Shadow Directories can be accessed at
        http://www.ietf.org/shadow.html


Abstract

   This document specifies a new Mobility Header message type that can
   be used between a home agent and mobile node to signal a mobile node
   that it should acquire a new home agent.

Conventions used in this document





Haley, et al           Expires - December 2006               [Page 1]
                      Home Agent Switch Message             June 2006


   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED",  "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC-2119 [1].

Table of Contents

   1. Introduction...................................................2
   2. Scenarios......................................................2
      2.1 Overloaded.................................................3
      2.2 Load Balancing.............................................3
      2.3 Maintenance................................................3
      2.4 Functional Load Balancing..................................3
      2.5 Home Agent Renumbering.....................................3
   3. Home Agent Switch Message......................................4
   4. Home Agent Operation...........................................6
      4.1 Sending Home Agent Switch Messages.........................6
      4.2 Retransmissions............................................6
      4.3 Mobile Node Errors.........................................7
   5. Mobile Node Operation..........................................7
      5.1 Receiving Home Agent Switch Messages.......................7
   6. Operational Considerations.....................................8
   7. Procotol Constants.............................................8
   8. IANA Considerations............................................8
   9. Security Considerations........................................8
   10. References....................................................9
      10.1 Normative References......................................9
      10.2 Informative references....................................9
   Acknowledgments...................................................9
   Author's Addresses................................................9


1. Introduction

   RFC 3775 [2] contains no provision to allow a home agent to inform a
   mobile node that it needs to stop acting as the home agent for the
   mobile node.  For example, a home agent may wish to handoff some of
   its mobile nodes to another home agent because it has become
   overloaded or it is going offline.

   This protocol describes a signaling message type that can be used to
   send a handoff notification between a home agent and mobile node.


2. Scenarios

   Here are some example scenarios where a home agent signaling message
   would be useful.




Haley, et al           Expires - December 2006               [Page 2]
                      Home Agent Switch Message             June 2006


2.1 Overloaded

   There are a number of reasons a home agent might be considered
   overloaded.  One might be that it is at, or near, its limit on the
   number of home bindings it is willing to accept.  Another is that it
   has reached a pre-determined level of system resource usage - memory,
   cpu cycles, etc.  In either case, it would be desirable for a home
   agent to reduce the number of home bindings before a failure occurs.

2.2 Load Balancing

   A home agent might know of other home agents on the link that are not
   as heavily loaded as itself, learned through some other mechanism
   outside the scope of this document.  An operator may wish to try and
   balance this load so a failure disrupts a smaller percentage of
   mobile nodes.

2.3 Maintenance

   Most operators do periodic maintenance in order to maintain
   reliability.  If a home agent is being shutdown for maintenance, it
   would be desirable to inform mobile nodes so they do not lose
   mobility service.

2.4 Functional Load Balancing

   A Mobile IPv6 home agent provides mobile nodes with two basic
   services - a rendezvous server where correspondent nodes can find the
   current care-of address for the mobile node, and as an overlay router
   to tunnel traffic to/from the mobile node at its current care-of
   address.

   A mobility service provider could have two sets of home agents to
   handle the two functions.  The rendezvous function could be handled
   by a machine specialized for high-speed transaction processing, while
   the overlay router function could be handled by a machine with high
   data throughput.

   A mobile node would start on the rendezvous server home agent and
   stay there if it does route optimization.  However, if the original
   home agent detects that the mobile node is not doing route
   optimization, but instead reverse-tunneling traffic, it could
   redirect the mobile node to a home agent with better data throughput.

2.5 Home Agent Renumbering

   Periodically, a mobility service provider may want to shut-down home
   agent services at a set of IPv6 addresses and bring service back up
   at a new set of addresses.  Note that this may not involve anything


Haley, et al           Expires - December 2006               [Page 3]
                      Home Agent Switch Message             June 2006


   as complex as IPv6 network renumbering, it may just involve changing
   the addresses of the home agents.  There are various reasons why a
   mobility service provider might want to do this; an example is if the
   service provider revokes the account of a user it has reason to
   believe might use the old home agent address to disrupt service for
   other users.  With a signaling message, the service provider could
   inform mobile nodes to look for a new home agent.


3. Home Agent Switch Message

   The Home Agent Switch message is used by the home agent to signal the
   mobile node that it needs to stop acting as the home agent for the
   mobile node, and that it should acquire a new home agent.  Home Agent
   Switch messages are sent as described in Section 4.

   The message described below follows the Mobility Header format
   specified in Section 6.1 of [2]:

    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    | Payload Proto |  Header Len   |   MH Type     |   Reserved    |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |           Checksum            |                               |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               |
    |                                                               |
    .                                                               .
    .                       Message Data                            .
    .                                                               .
    |                                                               |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+



















Haley, et al           Expires - December 2006               [Page 4]
                      Home Agent Switch Message             June 2006



   The Home Agent Switch Message uses the MH Type value (TBD).  When
   this value is indicated in the MH Type field, the format of the
   Message Data field in the Mobility Header is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
                                   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
                                   |# of Addresses |   Reserved    |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   +                                                               +
   .                                                               .
   .                      Home Agent Addresses                     .
   .                                                               .
   +                                                               +
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   +                                                               +
   .                                                               .
   .                        Mobility options                       .
   .                                                               .
   +                                                               +
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   # of Addresses

     A 16-bit unsigned integer indicating the number of IPv6 home agent
     addresses in the message.  If set to zero, the mobile node MUST
     perform home agent discovery.

   Reserved

     16-bit field reserved for future use.  The value MUST be
     initialized to zero by the sender, and MUST be ignored by the
     receiver.

   Home Agent Addresses

     A list of alternate home agent addresses on the home link for the
     mobile node.  The number of addresses present in the list is
     indicated by the "# of Addresses" field in the Home Agent Switch
     message.

   Mobility options



Haley, et al           Expires - December 2006               [Page 5]
                      Home Agent Switch Message             June 2006


     Variable-length field of such length that the complete Mobility
     Header is an integer multiple of 8 octets long.  This field
     contains zero of more TLV-encoded mobility options.  The encoding
     and format of defined options MUST follow the format specified in
     Section 6.2 of [2].  The receiver MUST ignore and skip any options
     with it does not understand.

     This specification does not define any options valid for the Home
     Agent Switch message.

   If no home agent addresses and no options are present in this
   message, no padding is necessary and the Header Len field in the
   Mobility Header will be set to 0.


4. Home Agent Operation

4.1 Sending Home Agent Switch Messages

   When sending a Home Agent Switch message, the sending node constructs
   the packet as it would any other Mobility Header, except:

     o The MH Type field MUST be set to (TBD).

     o If alternative home agent addresses are known, the sending home
        agent SHOULD include them in the list of suggested alternate
        home agents.  The home agent addresses field should be
        constructed as described in Section 10.5.1 of [2].

     o The "# of addresses" field MUST be filled-in corresponding to
        the number of home agent addresses included in the message.  If
        no addresses are present, the field MUST be set to zero, forcing
        the mobile node to perform home agent discovery by some other
        means.

   The Home Agent Switch message MUST use the home agent to mobile node
   IPsec ESP authentication SA for integrity protection.

   A home agent SHOULD send a Home Agent Switch message when a known
   period of unavailability is pending so the mobile node has sufficient
   time to find another suitable home agent.

4.2 Retransmissions

   If the home agent does not receive a response from the mobile node (a
   Binding Update message to delete its home binding), then it SHOULD
   retransmit the message, until a response is received.  The initial
   value for the retransmission timer is INITIAL-HA-SWITCH-TIMEOUT.



Haley, et al           Expires - December 2006               [Page 6]
                      Home Agent Switch Message             June 2006


   The retransmissions by the home agent MUST use an exponential back-
   off mechanism, in which the timeout period is doubled upon each
   retransmission, until either the home agent gets a response from the
   mobile node to delete its binding, or the timeout period reaches the
   value MAX-HA-SWITCH-TIMEOUT.

4.3 Mobile Node Errors

   If a mobile node does not understand how to process a Home Agent
   Switch Message, it will send a Binding Error message as described in
   Section 5.1.

   If a mobile node is unreachable, in other words, it still has a home
   binding with the home agent after reaching the timeout period of MAX-
   HA-SWITCH-TIMEOUT, the home agent SHOULD NOT make any conclusions
   about its status.

   In either case, the home agent SHOULD attempt to continue providing
   services until the lifetime of the binding expires.

   Attempts by the mobile node to extend the binding lifetime with a
   Binding Update message SHOULD be rejected, and a Binding
   Acknowledgement SHOULD be returned with status value 129
   (Administratively prohibited) as specified in Section 6.1.8 of [2].


5. Mobile Node Operation

5.1 Receiving Home Agent Switch Messages

   Upon receiving a Home Agent Switch message, the Mobility Header MUST
   be verified as specified in [2], specifically:

        o The Checksum, MH type, Payload Proto and Header Len fields
          MUST meet the requirements of Section 9.2 of [2].

        o The packet MUST be covered by the home agent to mobile node
          IPsec ESP authentication SA for integrity protection.

   If the packet is dropped due to the above tests, the receiving node
   MUST follow the processing rules as Section 9.2 of [2] defines.  For
   example, it MUST send a Binding Error message with the Status field
   set to 2 (unrecognized MH Type value) if it does not support the
   message type.

   Upon receipt of a Home Agent Switch message, the mobile node MUST
   stop using its current home agent for services and MUST delete its
   home binding by sending a Binding Update message as described in [2].
   This acts as an acknowledgement of the Home Agent Switch message.


Haley, et al           Expires - December 2006               [Page 7]
                      Home Agent Switch Message             June 2006



   If the Home Agent Switch message contains a list of alternate home
   agent addresses, the mobile node SHOULD select a home agent at random
   and establish the necessary IPsec security associations with the new
   home agent by whatever means required as part of the mobile node/home
   agent bootstrapping protocol for the home agent's mobility service
   provider.  If no alternate home agent addresses are included in the
   list, the mobile node MUST first perform home agent discovery.


6. Operational Considerations

   This document does not specify how an operator might use the Home
   Agent Switch message in its network.  However, it might be the case
   that a home agent provides service for many thousands of mobile
   nodes.  Care should be taken to reduce the signaling overhead
   required for handing off many mobile nodes to an alternate home
   agent.


7. Procotol Constants

   INITIAL-HA-SWITCH-TIMEOUT             5 seconds
   MAX-HA-SWITCH-TIMEOUT                 20 seconds


8. IANA Considerations

   A new Mobility Header type is required for the following new message
   described in Section 3:

     (TBD) Home Agent Switch message


9. Security Considerations

   As with other messages in [2], the Home Agent Switch message MUST use
   the home agent to mobile node IPsec ESP authentication SA for
   integrity protection.

   The Home Agent Switch message MAY use the IPsec ESP SA in place for
   Binding Updates and Acknowledgements as specified in Section 5.1 of
   [2], in order to reduce the number of configured security
   associations.  This also gives the message authenticity protection.

   Some operators may not want to reveal the list of home agents on the
   home link to on-path listeners.  In such a case, the Home Agent
   Switch message should use the home agent to mobile node IPsec ESP
   encryption SA for confidentiality protection.


Haley, et al           Expires - December 2006               [Page 8]
                      Home Agent Switch Message             June 2006




10.  References

10.1  Normative References

   [1] Bradner, S., "Key words for use in RFCs to Indicate Requirement
      Levels", BCP 14, RFC 2119, March 1997

   [2] Johnson, D. Perkins, C., and Arkko, J., "Mobility Support in
      IPv6", RFC 3775, June, 2004.


10.2  Informative references


Acknowledgments

   We would like to thank the authors of a number of previous drafts
   that contributed content to this document:

        o draft-wakikawa-mip6-nemo-haha-spec-00.txt
        o draft-deng-mip6-ha-loadbalance-02.txt
        o draft-kempf-mip6-ha-alert-00.txt
        o draft-haley-mip6-mh-signaling-00.txt


Author's Addresses

   Brian Haley
   Hewlett-Packard Company
   110 Spitbrook Road
   Nashua, NH 03062, USA
   Email: brian.haley@hp.com

   Vijay Devarapalli
   Azaire Networks
   4800 Great America Pkwy
   Santa Clara, CA 95054 USA
   Email: vijay.devarapalli@azairenet.com

   James Kempf
   DoCoMo USA Labs
   181 Metro Drive
   Suite 300
   San Jose, CA 95110 USA
   Email: kempf@docomolabs-usa.com




Haley, et al           Expires - December 2006               [Page 9]
                      Home Agent Switch Message             June 2006


   Hui Deng
   Research & Development Center
   Hitachi (China), Investment Ltd.
   Beijing Fortune Bldg. 1701, 5 Dong San Huan Bei-Lu
   Chao Yang District, Beijing 100004, China
   Email: hdeng@hitachi.cn



Intellectual Property Statement

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed to
   pertain to the implementation or use of the technology described in
   this document or the extent to which any license under such rights
   might or might not be available; nor does it represent that it has
   made any independent effort to identify any such rights.  Information
   on the procedures with respect to rights in RFC documents can be
   found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use of
   such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository at
   http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights that may cover technology that may be required to implement
   this standard.  Please address the information to the IETF at
   ietf-ipr@ietf.org.

Disclaimer of Validity

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET
   ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED,
   INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE
   INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.

Copyright Statement

   Copyright (C) The Internet Society (2006).  This document is subject
   to the rights, licenses and restrictions contained in BCP 78, and
   except as set forth therein, the authors retain all their rights.



Haley, et al           Expires - December 2006              [Page 10]
                      Home Agent Switch Message             June 2006



Acknowledgment

   Funding for the RFC Editor function is currently provided by the
   Internet Society.














































Haley, et al           Expires - December 2006              [Page 11]

